cf-src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf-src/CommonModules/УправлениеЦенами/Ext/Module.bsl
#Если Сервер Тогда

Функция ПолучитьЦенуНоменклатуры(Номенклатура, ВидЦен, МоментЦены = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(Номенклатура) ИЛИ НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		Возврат 0;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Цены.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Момент,
	|		Номенклатура = &Номенклатура
	|			И ВидЦен = &ВидЦен) КАК Цены";
	
	Запрос.УстановитьПараметр("Момент", ?(ЗначениеЗаполнено(МоментЦены), МоментЦены, ТекущаяДата()));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ВидЦен", ВидЦен);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Цена;
	КонецЕсли;
	
	Возврат 0;

КонецФункции

Процедура ЗаполнитьЦеныВТабличнойЧасти(ТабличнаяЧасть, ВидЦен, МоментЦены = Неопределено) Экспорт

	Если ТабличнаяЧасть = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого СтрокаТовара Из ТабличнаяЧасть Цикл
		Если ЗначениеЗаполнено(СтрокаТовара.Номенклатура) Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаТовара.Цена) ИЛИ СтрокаТовара.Цена = 0 Тогда
				СтрокаТовара.Цена = ПолучитьЦенуНоменклатуры(СтрокаТовара.Номенклатура, ВидЦен, МоментЦены);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура УстановитьЦенуНоменклатуры(Номенклатура, ВидЦен, Цена, МоментЦены = Неопределено) Экспорт

	Если НЕ ЗначениеЗаполнено(Номенклатура) ИЛИ НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		Возврат;
	КонецЕсли;
	
	Набор = РегистрыСведений.ЦеныНоменклатуры.СоздатьНаборЗаписей();
	Запись = Набор.Добавить();
	Запись.Период = ?(ЗначениеЗаполнено(МоментЦены), МоментЦены, ТекущаяДата());
	Запись.Номенклатура = Номенклатура;
	Запись.ВидЦен = ВидЦен;
	Запись.Цена = Цена;
	Набор.Записать();

КонецПроцедуры

#КонецЕсли
